In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = {

'Name' : ['Pankaj', 'Meghna', 'David', 'Lisa'],

'ID' : [1, 2, 3, 4],

'Salary': [100, 200, np.nan, pd.NaT],

'Role' : ['CEO', None, pd.NaT, pd.NaT]

}

In [3]:
df = pd.DataFrame(d1)
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [4]:
df.head(2)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None

In [5]:
df.tail(2)

    Name  ID Salary Role
2  David   3    NaN  NaT
3   Lisa   4    NaT  NaT

In [6]:
df.isnull().sum()

Name      0
ID        0
Salary    2
Role      3
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   ID      4 non-null      int64
 2   Salary  2 non-null      object
 3   Role    1 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [8]:
df1 = df.dropna()
df1

     Name  ID Salary Role
0  Pankaj   1    100  CEO

In [9]:
df2 = df.dropna(axis=1)
df2

     Name  ID
0  Pankaj   1
1  Meghna   2
2   David   3
3    Lisa   4

In [10]:
df['Salary'].fillna('300')
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [11]:
df['Role'].fillna('CEO')
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT